"""
    문제유형: 탐색
    
    대표 알고리즘/자료구조:
    - Linear Search(선형 탐색)
    - Binary Search(이진 탐색)
    - 완전탐색
    - DFS(깊이 우선 탐색)
    - BFS(넓이 우선 탐색)
    
    특징:
    - 가능한 경우를 찾아라
    - 최소 몇 번 이동?
    
"""
# Linear Search(선형 탐색) -------------------------------------------------------
"""
    ***처음부터 하나씩 비교하며 찾는다***
    - 배열의 첫 번째 원소부터 마지막 원소까지 하나씩 확인하면서 원하는 값을 찾는 알고리즘
    - 정렬되지 않은 배열에서도 사용 가능
    - 구현이 간단
    - 최악의 경우, 모든 원소를 확인 --> 입력 크기 N에 비례해서 탐색 시간이 증가
    
    Time Complexity:
    - Best    : O(1)
    - Average : O(N)
    - Worst   : O(N)
    
    Space Complexity:
    - O(1)
    
    선형 탐색을 떠올릴 수 있는 상황:
    - 배열이 정렬되어 있지 않은 경우
    - 데이터의 크기가 작은 경우
    - 특징 값의 첫 번째 index를 찾는 경우
    - 배열을 한 번 순회하며 조건을 검사하는 경우
"""

def linear_search(arr,target):
    for i in range(len(arr)): # 리스트의 길이만큼 반복(모든 인덱스 참조)
        if arr[i] == target:
            return i # 타겟 반환
    return -1 # 타겟이 리스트에 없으면 -1 반환


# Binary Search(이진 탐색) -------------------------------------------------------
"""

"""

# (완전탐색) -------------------------------------------------------------
"""
    
    
"""

# DFS(깊이 우선 탐색) -------------------------------------------------------------
"""

"""

# BFS(넓이 우선 탐색) -------------------------------------------------------------
"""

"""
