"""
    문제 유형: 정렬
    
    대표 알고리즘/자료구조:
    - 선택 정렬
    - 버블 정렬
    - 삽입 정렬
    - 병합 정렬
    - 퀵 정렬
    - 힙 정렬
    - 계수 정렬
    
    특징:
    - 가장 큰/작은
    - 순서대로
    - 순위
    - N번째로 큰 값
    - 오름차순/내림차순
    - 두 배열을 비교
    - 정렬 후 선택
"""

# Selection Sort(선택 정렬) ------------------------------------------------------
"""
    - 현재 위치에 들어갈 가장 작은 값을 남아 있는 데이터에서 찾아 교환하는 정렬 알고리즘
    *** "남은 범위에서 가장 작은 값을 찾아 앞으로 보낸다." ***
    
    ex)
    arr =  [5, 2, 8, 1, 3]
    최솟값 = 1
    첫번째 자리의 5와 최솟값인 1의 위치를 교환
    arr = [1, 2, 8, 5, 3]
    arr = [1, | 2, 8, 5, 3]
    인덱스 0 과 1사이에 벽이 있다고 생각하고 인덱스 1부터 같은 프로세스 진행
    
    Time Complexity:
    - Best Case    : O(N^2)
    - Average Case : O(N^2)
    - Worst Case   : O(N^2)
    
    선택 정렬을 떠올릴 수 있는 상황:
    - 남은 데이터에서 최솟값/최댓값을 반복적으로 선택하는 구조
    - 거의 arr.sort()나 sorted(arr)로 대체 가능
    
"""
def selection_sort(arr):
    n = len(arr) # arr의 길이
    
    for i in range(n):
        min_idx = i # 현재 위치 i를 최솟값이라고 가정
        
        for j in range(i+1, n): # 아직 정렬되지 않은 벽 오른쪽 영역 탐색
            
            if arr[j] < arr[min_idx]: # 더 작은 값을 발견한다면
                min_idx = j # 그 값을 index로 갱신
            
        arr[i],arr[min_idx] = arr[min_idx], arr[i] # 현재 위치와 실제 최솟값을 교환
    
    return arr # 정렬된 arr 반환

# Bubble Sort(버블 정렬) ---------------------------------------------------------
"""
    - 인접한 두 원소를 비교하고 필요할 때마다 교환(스왑)하는 방식
    *** 인접한 두 값을 비교하며 큰 값을 오른쪽으로 보낸다 / 큰 수는 거품처럼 뒤로 떠오른다 ***
    
    ex)
    arr = [5, 2, 8, 1, 3]
    1트:
    [5, 2, 8, 1, 3] -- 5 > 2 so swap
    [2, 5, 8, 1, 3] -- 5 < 8 so stay
    [2, 5, 8, 1, 3] -- 8 > 1 so swap
    [2, 5, 1, 8, 3] -- 8 > 3 so swap finish
    [2, 5, 1, 3, | 8]
    2트:
    arr = [2, 5, 1, 3, | 8]
    [2, 5, 1, 3, | 8] -- 5 > 1 so swap
    [2, 1, 5, 3, | 8] -- 5 > 3 so swap
    [2, 1, 3, | 5, 8] -- 5 < 8 so stay finish
    3트:
    arr = [2, 1, 3, | 5, 8]
    [2, 1, 3, | 5, 8] -- 2 > 1 -- so swap
    [1, 2, | 3, 5, 8] -- 2 < 3 -- so stay finish
    
    Time Complexity:
    - Best    : O(N^2)
    - Average : O(N^2)
    - Worst   : O(N^2)
    
    버블 정렬을 떠올릴 수 있는 상황:
    - 인접한 두 원소를 비교하여 정렬하는 문제
    - 인접한 원소끼리만 swap할 수 있는 문제
    - 정렬 과정에서 swap 횟수를 분석하는 문제
"""

def bubble_sort(arr):
    n = len(arr) # arr의 길이
    
    for i in range(n-1): # 1개 정해 놓고 반복돌리니까 (전체길이 - 1)만큼 반복
        
        for j in range(n-1-i): # j+1에 접근하므로 마지막 index 넘는걸 방지
            if arr[j] > arr[j+1]: # 원소 비교해서 왼쪽이 더 크면
                arr[j],arr[j+1] = arr[j+1],arr[j] # 오른쪽 원소랑 자리 교체
    
    return arr # 정렬된 arr 반환


# Insertion Sort(삽입 정렬) ------------------------------------------------------
"""

"""

# Merge Sort(병합 정렬) ----------------------------------------------------------
"""

"""

# Quick Sort(퀵 정렬) ------------------------------------------------------------
"""

"""

# Heap Sort(힙 정렬) -------------------------------------------------------------
"""

"""

# Counting Sort(계수 정렬) -------------------------------------------------------
"""

"""
